lisir233/ESP-Iris/components/esp_iris/test_apps/system_inventory/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s31"
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
CONFIG_ESP_IRIS_TRANSPORT_TCP=y
CONFIG_ESP_IRIS_SYSTEM_INVENTORY=y
# CONFIG_ESP_IRIS_SYSTEM_UPDATE is not set

CONFIG_ESP_IRIS_FIRMWARE_ROLE=1
